tap "heroku/brew"
tap "bramstein/webfonttools"

# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"

# Keep bash available alongside zsh
brew "bash"
brew "bash-completion2"
brew "zsh-completions"

# Core tools
brew "wget"
brew "git"
brew "starship"
brew "ack"
brew "tree"
brew "imagemagick"
brew "lua"
brew "pandoc"
brew "speedtest-cli"

# Modern replacements for macOS system tools
brew "grep"
brew "openssh"
brew "screen"

# Font tools
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# Languages
brew "python"
brew "ruby-build"
brew "rbenv"

# Heroku
brew "heroku/brew/heroku"

# Apps
cask "iterm2"
cask "visual-studio-code"
cask "alfred"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "1password"
cask "docker"
cask "github"
cask "virtualbox"
cask "vagrant"

# Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
